Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder Methods
The PolycurveGeometryBuilder type exposes the following members.
Methods
Name | Description
Append(Arc)
 Appends an arc to the geometry list
Append(LineSegment)
 Appends a line segment to the geometry list
Append(Polycurve)
 Appends another polycurve to the geometry list
AppendArc
 Appends an arc using three points. The first point is taken as the last point of the last element of the polycurve.
AppendSegment
 Appends an line segment. The first point is taken as the last point of the last element of the polycurve.
AppendTangentArc
 Appends an arc tangent to the last curve of the curve list.
AppendTangentSegment
 Appends a line segment of the given length tangent to the last curve of the list.
GetPolycurve
 Gets the final geometry after all the modifications made by the builder
Prepend(Arc)
 Prepends an arc to the geometry list
Prepend(LineSegment)
 Prepends a line segment to the geometry list
PrependArc
 Prepends an arc using three points. The last point is taken as the start point of the first element of the polycurve.
PrependSegment
 Prepends an line segment. The last point is taken as the start point of the first element of the polycurve.
PrependTangentArc
 Prepends an arc tangent to the first curve of the curve list.
PrependTangentSegment
 Prepends a line segment of the given length tangent to the first curve of the list.
Replace(Int32, Arc)
 Replaces the geometry at a given index
Replace(Int32, LineSegment)
 Replaces the geometry at a given index
Top
See Also
Reference
PolycurveGeometryBuilder Class
Tekla.Structures.Geometry3d Namespace